{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Nina B. Zumel",
	"language": "en",
	"home_page_url": "https://ninazumel.com/",
	"feed_url": "https://ninazumel.com/feed.json",
	"description": "Data Scientist, San Francisco",
	"author": {
		"name": "Nina B. Zumel",
		"url": "https://ninazumel.com"
	},
	"items": [
		{
			"id": "https://ninazumel.com/blog/2024-02-21-clarity-not-magic/",
			"url": "https://ninazumel.com/blog/2024-02-21-clarity-not-magic/",
			"title": "Clarity, Not Magic",
			"content_html": "<p>After migrating this blog to Eleventy, I made the comment on Micro.blog that Eleventy &quot;is so much easier to wrap my arms around&quot; than Jekyll was. That got me to wondering--why is that?</p>\n<p>After some thought, I came up with a few reasons:</p>\n<ul>\n<li>Newbie-friendly design and documentation that makes the process less opaque.</li>\n<li>Starter code that is simple to read, but that still illustrates useful functionality</li>\n<li>A blog deployment process that is manual, but not mystical.</li>\n</ul>\n<p>That last point is the crux, for me. After all, the reason I migrated my site was because the old one broke, and <em>I didn't know how to fix it</em>. I won't lie. The way the old site got automatically built and deployed on Github Pages was mysterious to me. I found a Jekyll template I wanted, and followed some directions that seemed to work, and <em>Voila!</em> To me, setting up that first website was not that far removed from following some arcane ritual.</p>\n<p>And it worked, until it didn't. I knew that something, somewhere was going out of date and needed to be updated, but I didn't know what, or how. And so I had to start from scratch.</p>\n<p>And this time, no magic incantations.</p>\n<p>So, this post will expand upon the points above, but it's really not about my adventures with Eleventy. It's meant to be a concrete exploration of some general principles about how to design a process; how to teach (or document) a process; and the difference between informed, purposeful action versus blindly following ritual.</p>\n<p>Read on.</p>\n<img alt=\"Illustration of the Sorcerer's Apprentice trying to bring the broom to life. Ferdinand Barth\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/sorcerer-barth-FaSJaIlHz3-400.png\" width=\"435\" height=\"480\" srcset=\"https://ninazumel.com/img/sorcerer-barth-FaSJaIlHz3-400.png 400w, https://ninazumel.com/img/sorcerer-barth-FaSJaIlHz3-435.png 435w\" sizes=\"20vw\">\n<p class=\"caption\">Illustration of Goethe's <em>Der Zauberlehrling</em> (The Sorcerer's Apprentice), 1882. Artist: Ferdinand Barth<br> \nSource: <a href=\"https://commons.wikimedia.org/wiki/File:Tovenaarsleerling_S_Barth.png\">Wikimedia</a></p>\n<h2 id=\"newbie-friendly-non-opaque-design\" tabindex=\"-1\">Newbie-Friendly, Non-Opaque Design <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2024-02-21-clarity-not-magic/\">#</a></h2>\n<p>The default way of putting a blog on Github Pages involves some mysterious (to me) interaction of Gemfiles and Github Actions and automated processes that are hidden from the user. I try reading the documentation, but it's written assuming some background context/knowledge that I don't have. I can make it work--I've put up at least three Jekyll blogs, starting from other people's templates--but I've never really understood the workings of the process. And every time I want to put up a blog, I have to look up how to do it.</p>\n<p>The Eleventy &quot;Get Started&quot; page is so newbie-friendly that it even has a link to <a href=\"https://www.11ty.dev/docs/terminal-window/\">a page that explains terminal windows</a>. It walked me through installing Node.js, and the commands that I need to install Eleventy, build a rudimentary website, and serve it (locally). Now, I don't know anything about Node.js or JavaScript, but by walking through the tutorial and looking at the artifacts produced: the <code>package.json</code>, the <code>node_modules</code> directory, and so on -- I gained some intuition about how the process works.</p>\n<p>Because I feel like I understand what's going on, I can write down the steps in a way that makes sense to me, and <em>repeat it</em> -- purposefully, not blindly. In other words, there is something about the design of the software <em>and</em> its starter documentation that elucidates the process, making it easier to follow.</p>\n<p>Incidentally, the &quot;Get Started&quot; page even shows you how to deploy the baby website, via Netlify. It looked pretty easy, and if I were starting brand-new, I probably would have gone that route. But I'm already on Github Pages, so I decided to stick with that. I was a little nervous about this choice, but it turned out quite well---more on that later.</p>\n<p>Most of the Eleventy documentation still goes over my head, but I'm not worried about that, because I had ...</p>\n<h2 id=\"a-simple-but-functional-starter-example\" tabindex=\"-1\">A Simple but Functional Starter Example <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2024-02-21-clarity-not-magic/\">#</a></h2>\n<p>This is an extension of the &quot;Newbie-friendly design&quot; principle. The first time I stood up my site, I knew nothing about &quot;website stuff&quot; except some rudimentary HTML. I needed code examples, to help teach me about CSS, and Liquid, and so on. The built-in Github Pages Jekyll themes were <em>too simple</em> to help me understand how to build the structure of a blog. The theme I ended up using made a nice site, but it was really <em>too complex</em> to be an effective learning instrument. So it, too, for a long time, was mostly just magic.</p>\n<p>Eleventy's <a href=\"https://github.com/11ty/eleventy-base-blog\">base blog starter template</a> has enough functionality to be useful, a clear and simple design, good file organization, and low dependencies: HTML/markdown, CSS, Nunjucks, minimal Javascript. By looking at the code, and by peeking into the <code>package.json</code> and the <code>node_modules</code> directory that got generated when I installed the template, I could figure out how things work. I can't build a theme from scratch, but I can figure out how to modify this one. A little at a time.</p>\n<p>It's not magic, and eventually, I assume, more of the documentation will make sense. If I need it to.</p>\n<p>My new site is still missing a few things I had before, but it's not bad-looking, if I do say so myself.</p>\n<h2 id=\"non-mystical-deployment\" tabindex=\"-1\">Non-Mystical Deployment <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2024-02-21-clarity-not-magic/\">#</a></h2>\n<p>This was the step that made me nervous. Jekyll is the default build process for Github Pages sites. How was a non-Jekyll build going to work? Would I be able to do it?</p>\n<p>The official answer is Github Actions, and someone did write an Action for deploying Eleventy sites. But guess what: I don't understand Github Actions. This felt like bringing more magic into the workflow, and if that Action ever broke---I'd be stuck, again.</p>\n<p>So I looked around, and figured out that I could build and deploy the site manually, with the help of <a href=\"https://www.npmjs.com/package/gh-pages\">this package</a>. It's far less convenient than having the site just rebuild when I push changes to the source, <em>but I know what it's doing</em>. And my site isn't going to change that frequently, anyway. Under the circumstances, a manual process I understand is preferable to an automation that I don't understand, and don't really need. Someday, my assessment of the tradeoffs may change; and then my mind will change, too.</p>\n<p>Right now, it works like a charm.</p>\n<p><em>But Nina, why is a Github Action magic, but a package you found on the internet not magic?</em></p>\n<p>Yeah, I suppose it's magic, too, but it's magic that works over <em>Git</em>, not <em>Github</em>. I suspect git is somewhat more stable than any given Github feature. Also, I understand git. So I'd call the package &quot;less magic&quot; than an Action. To me, that is; if you are comfortable with Github Actions, then none of this is magic at all. Go crazy.</p>\n<h2 id=\"so-what-have-we-learned\" tabindex=\"-1\">So, What Have We Learned? <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2024-02-21-clarity-not-magic/\">#</a></h2>\n<p>Out of all this, I can try to articulate some general principles, in no particular order.</p>\n<p>Avoid magic. If you do X by blindly following a list of steps you don't understand, you don't know how to do X. You're just following a ritual. And rituals can fail.</p>\n<p>By the above definition, magic is relative.</p>\n<p>A well-designed process is complex enough to be useful, but simple and clear enough to be learnable.</p>\n<p>A good teaching example (code, documentation) should also be complex enough to be useful, but simple and clear enough to be learnable.</p>\n<p>Try to be newbie-friendly. If you can write or design for a user who knows absolutely nothing at the start, but will have <em>something</em> by the end, someone out there will thank you for it.</p>\n<p>Prefer understanding a process (&quot;no magic&quot;) to streamlining it (opaque automations might be magic).</p>\n",
			"date_published": "2024-02-21T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2024-02-19-new-blogging-framework/",
			"url": "https://ninazumel.com/blog/2024-02-19-new-blogging-framework/",
			"title": "Blog Migration",
			"content_html": "<p>My jekyll-generated website (served by Github Pages) failed to build a couple of weeks ago; I don't know why. I'm not enough of a front-end developer to diagnose the problem. After looking around for an updated template to move to, I eventually decided to give the <a href=\"https://www.11ty.dev/\">Eleventy static site generator</a> a try.</p>\n<p>So this is my new site, based on Eleventy's <a href=\"https://github.com/11ty/eleventy-base-blog\">official starter blog</a> template. It wasn't too hard to figure out, and deployed surprisingly easily! Best of all, Eleventy is built to be <a href=\"https://www.11ty.dev/blog/stability/\">stable</a>; which hopefully means I won't run into that <em>my website won't build, and I don't know why!</em> problem again[1]. Hurray!</p>\n<p>A better developer than I am probably could have migrated the old jekyll site completely, but I didn't manage to do that. I've only carried a few blog posts and pages over for the moment. I'll put a few more of the old posts back, and my publications page; eventually I'll figure out how to get my bookshelf and my talks pages back up, too. But at least there's something here, for now.</p>\n<hr>\n<p>[1]: It's also designed to <a href=\"https://www.11ty.dev/docs/performance/\">build really fast</a>, but that matters less to me.</p>\n",
			"date_published": "2024-02-19T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2024-01-29-fun-with-chatgpt/",
			"url": "https://ninazumel.com/blog/2024-01-29-fun-with-chatgpt/",
			"title": "Fun With Chat GPT",
			"content_html": "<p>So, my husband typed this into ChatGPT 3.5:</p>\n<blockquote>\n<p>What are some English words that are 4 letters long, start with f, and end with k?</p>\n</blockquote>\n<p>According to ChatGPT, there was only one word that fit that criterion: <em>fork</em>.  Upon prodding, it admitted that there were maybe a few more:</p>\n<img alt=\"Screenshot from ChatGPT 3.5\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-400.png\" width=\"3182\" height=\"2287\" srcset=\"https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-400.png 400w, https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-800.png 800w, https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-1200.png 1200w, https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-3182.png 3182w\" sizes=\"100vw\">\n<p>Typing a similar query into DuckDuckGo (<em>4 letter word starting with f ending with k</em>) produced a page full of links to various crossword puzzle and Scrabble dictionaries. The first link gave me seven words. A little further down, I found a link that gave me thirteen words: faik, fank, feck, filk, fink, firk, fisk, flak, folk, fork, funk, fusk, and of course, &quot;the F-word.&quot;</p>\n<p>I'm sure that ChatGPT has filters to eliminate profanity, and admittedly, not all the above words are &quot;common,&quot; but, come on -- <em>folk</em>? <em>funk</em>? <em>flak</em>??  I particularly like <em>feck</em>, though I never hear of anyone being &quot;full of feck,&quot; only &quot;feckless&quot; ...</p>\n<p>I'm sure GPT-4 does better, but I don't care to pay to find out.</p>\n",
			"date_published": "2024-01-29T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2023-08-21-the-sphering-transform/",
			"url": "https://ninazumel.com/blog/2023-08-21-the-sphering-transform/",
			"title": "The Sphering Transform for Detecting Distribution Drift",
			"content_html": "<p>I have a new blog post up on the Win Vector blog: <a href=\"https://win-vector.com/2023/08/20/detecting-data-differences-using-the-sphering-transform/\">Detecting Data Differences Using the Sphering Transform</a>.</p>\n<img alt=\"Distributions of sphered norms for two data sets with different distributions\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/new_raw_comp_xformed-s2pbz_kSJE-400.png\" width=\"609\" height=\"470\" srcset=\"https://ninazumel.com/img/new_raw_comp_xformed-s2pbz_kSJE-400.png 400w, https://ninazumel.com/img/new_raw_comp_xformed-s2pbz_kSJE-609.png 609w\" sizes=\"50vw\">\n<p>In this post, I discuss how to convert the problem of detecting changes in multivariate distributions to the simpler problem of detecting changes in univariate distributions. Please check it out.</p>\n",
			"date_published": "2023-08-21T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2023-04-10-pandas-polars-rosetta-stone/",
			"url": "https://ninazumel.com/blog/2023-04-10-pandas-polars-rosetta-stone/",
			"title": "Pandas-Polars Rosetta Stone",
			"content_html": "<p>Just created a <a href=\"https://github.com/WinVector/Examples/blob/main/pandas_polars_rosettastone/rosetta.ipynb\">handy little Rosetta stone</a> of common data operations using both the <code>pandas</code> and <code>polars</code> libraries. Maybe you'll find it useful, too.</p>\n",
			"date_published": "2023-04-10T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/",
			"url": "https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/",
			"title": "The What, Why, and How of AB Testing",
			"content_html": "<p><em>This article is a shortened version of a <a href=\"https://www.wallaroo.ai/blog/the-what-why-and-how-of-a/b-testing\">post from the Wallaroo Blog</a>, originally written by <a href=\"https://www.linkedin.com/in/juliobarros/\">Julio Barros</a> and me. I'm posting the non-Wallaroo section of that article here, with permission, because I think it's a useful reference for A/B testing---one that I refer to myself. Hopefully, others find it helpful as well.</em></p>\n<hr>\n<h2 id=\"how-to-a-b-test-machine-learning-models\" tabindex=\"-1\"><strong>How to A/B Test Machine Learning Models</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h2>\n<p><em>A/B tests are a key tool of business decision-making. In this article, we'll discuss the what and why of A/B testing, and how an A/B test is designed.</em></p>\n<h2 id=\"what-is-an-a-b-test\" tabindex=\"-1\">What is an A/B Test? <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h2>\n<p>An <a href=\"https://en.wikipedia.org/wiki/A/B_testing\">A/B test</a>, also called a controlled experiment or a randomized control trial, is a statistical method of determining which of a set of variants is the best. A/B tests allow organizations and policy-makers to make smarter, data-driven decisions that are less dependent on guesswork.</p>\n<p>In the simplest version of an A/B test, subjects are randomly assigned to either the control group (group A) or the treatment group (group B). Subjects in the treatment group receive the treatment (such as a new medicine, a special offer, or a new web page design) while the control group proceeds as normal without the treatment. Data is then collected on the outcomes and used to study the effects of the treatment.</p>\n<img alt=\"AB testing\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/AB-Testing-_poswn2rZ2-400.png\" width=\"900\" height=\"680\" srcset=\"https://ninazumel.com/img/AB-Testing-_poswn2rZ2-400.png 400w, https://ninazumel.com/img/AB-Testing-_poswn2rZ2-800.png 800w, https://ninazumel.com/img/AB-Testing-_poswn2rZ2-900.png 900w\" sizes=\"100vw\">\n<p class=\"caption\">Author: Seobility - License: <a href=\"https://www.seobility.net/en/wiki/Creative_Commons_License_BY-SA_4.0\">[CC BY-SA 4.0]</a>( \"Creative Commons License BY-SA 4.0\")</p>\n<h3 id=\"a-b-testing-in-history\" tabindex=\"-1\"><strong>A/B Testing in History</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p>This idea has been around for a long time. Historically, farmers have divided their fields into sections to test whether various treatments can improve their crop yield. Something like an A/B nutrition test even appears in the Old Testament!</p>\n<blockquote>\n<p>“Please test your servants for ten days. Let us be given vegetables to eat and water to drink. You can then compare our appearance with the appearance of the young men who eat the royal rations…&quot; (Daniel 1:12-13)</p>\n</blockquote>\n<p>In 1747, Dr. James Lind conducted one of the earliest clinical trials, testing the <a href=\"https://en.wikipedia.org/wiki/James_Lind#Prevention_and_cure_of_scurvy\">efficacy of citrus fruit for curing scurvy</a>.</p>\n<h3 id=\"a-b-testing-today\" tabindex=\"-1\"><strong>A/B Testing Today</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p>Today, A/B tests are an important business tool, used to make decisions in areas like product pricing, website design, marketing campaign design, and brand messaging. A/B testing lets organizations quickly experiment and iterate in order to continually improve their business.</p>\n<p><strong>In data science</strong>, A/B tests can also be used to choose between two models in production, by measuring which model performs better in the real world. In this formulation, the control is often an existing model that is currently in production, sometimes called the <strong><em>champion</em></strong>. The treatment is a new model being considered to replace the old one. This new model is sometimes called the <strong><em>challenger</em></strong>. In our discussion, we'll use the terms <em>champion</em> and <em>challenger</em>, rather than <em>control</em> and <em>treatment</em>.</p>\n<p>Keep in mind that in machine learning, the terms <em>experiments</em> and <em>trials</em> also often refer to the process of finding a training configuration that works best for the problem at hand (this is sometimes called hyperparameter optimization). In this article, we will use the term <em>experiment</em> to refer to the use of A/B tests to compare the performance of different models in production.</p>\n<h2 id=\"how-to-design-an-a-b-test\" tabindex=\"-1\"><strong>How to Design an A/B Test</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h2>\n<p>A/B tests are a useful way to rely less on opinions and intuition and to be more data-driven in decision making, but there are a few principles to keep in mind. The experimenter has to decide on a number of things.</p>\n<p><strong>First, decide what you are trying to measure.</strong> We'll call this the <em>Overall Evaluation Criterion</em> or <em>OEC</em>. This may be different and more business-focused than the loss function used while training the models, but it must be something you can measure. Common examples are revenue, click-thru rate, conversion rate, or process completion rate.</p>\n<p><strong>Second, decide how much better is &quot;better&quot;.</strong> You might want to just say &quot;Success is when the challenger is better than the champion,&quot; but that's actually not a testable question, at least not in the statistical sense. You have to decide <em>how much</em> better the challenger has to be. Let's define two quantities:</p>\n<ul>\n<li>\n<p><strong><em>y0</em></strong><em>:</em> The champion's assumed OEC. Since the champion has been running for a while, we should have a good idea of this value. For example, if we are measuring conversion rate, then we might already know that the champion typically achieves a conversion rate of <em>y0 =</em> 2%.</p>\n</li>\n<li>\n<p>𝞭: the <em>minimum delta effect size</em> we want to reliably detect. This is how much better the challenger needs to be for us to declare it &quot;the winner.&quot; For example, we may decide to switch to our challenger model if it improves the conversion rate by at least 1% – that is, we want the challenger to have a conversion rate of at least 0.02 * (1.01) = 0.0202. This means 𝞭 = 0.002.</p>\n</li>\n</ul>\n<p>Note that some sample size calculators (we'll get to that below) specify minimum effect size as a relative delta; in our example, the relative delta is 0.01 (1%), and the absolute delta is 0.002.</p>\n<p><strong>Third, decide how much error you want to tolerate</strong>. Again, you probably want to say &quot;none,&quot; but that isn't practical. The less error you can tolerate, the more data you need, and in an online setting, the longer you have to run the test. In the classical statistics formulation, an A/B test has the following parameters to describe the error:</p>\n<ul>\n<li>\n<p><strong>𝞪:</strong> the <em>significance</em>, or <em>false positive rate</em> that we are willing to tolerate. Ideally, we want 𝞪 as small as possible; in practice, 𝞪 is usually set to 0.05. You can think of this as meaning that if we run an A/B test over and over again, we will incorrectly pick an inferior challenger 5% of the time.</p>\n</li>\n<li>\n<p><strong>𝞫:</strong> the <em>power</em>, or <em>true positive rate</em> we want to achieve. Ideally, we would like 𝞫 near 1; in practice, 𝞫 is usually set to 0.8. You can think of this as meaning that if we run an A/B test over and over again we will correctly pick a superior challenger 80% of the time.</p>\n</li>\n</ul>\n<p>Note that 𝞪 and 𝞫 are talking about incompatible circumstances (that's why they don't add up to 1). The first case assumes the challenger is worse, the other case assumes it's better; finding out which situation we are in is the whole point of an A/B test.</p>\n<p>There's one last parameter in an A/B test:</p>\n<ul>\n<li><strong><em>n</em>:</strong> the minimum number of examples (per model) we have to examine to make sure our false positive rate 𝞪 and true positive rate 𝞫 thresholds are met. Or as it's commonly said: &quot;to make sure we achieve statistical significance.&quot;</li>\n</ul>\n<p>Note that n is per model: so if you are routing your customers between A and B with a 50-50 split, you need a total experiment size of 2<em>n customers. If you are routing 90% of your traffic to A and 10% to B, then B has to see at least n customers (and A will then see around 9</em>n). So a 50-50 split is the most efficient, although you may prefer an unbalanced split for other reasons, like safety or stability.</p>\n<p>To run an A/B test, the experimenter picks 𝞪, 𝞫, and the minimum effect size 𝞭, and then determines <em>n</em>. We won't go into the formula for calculating <em>n</em> here; so-called power calculators or sample-size calculators exist to do that for you. <a href=\"https://statsig.com/calculator\">Here's one for rates, from Statsig</a>; it defaults to 𝞪 = 0.05, 𝞫 = 0.8, and split ratio of 50-50. Feel free to play around to get a sense of how big sample sizes have to be in different situations.</p>\n<p>Once you've run the A/B test long enough to achieve the necessary <em>n</em>, measure the OEC for each model. If OECchallenger - OECchampion &gt; 𝞭, then the challenger wins! Otherwise, you may wish to stick with the champion model.</p>\n<h3 id=\"some-practical-considerations\" tabindex=\"-1\"><strong>Some Practical Considerations</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p><strong>Splitting your subjects:</strong> When splitting your subjects up randomly between models, make sure the process is truly random, and think through any interference between the two groups. Do they communicate or influence each other in some way? Does the randomization method cause an unintended bias? Any bias in group assignments can invalidate the results. Also, make sure the assignment is consistent so that each subject always gets the same treatment. For example, a specific customer should not get different prices every time they reload the pricing page.</p>\n<p><strong>A/A Tests:</strong> It can be a good idea to run an A/A test, where both groups are control or treatment groups. This can help surface unintentional biases or errors in the processing and can give a better feeling for how random variations can affect intermediate results.</p>\n<p><strong>Don't Peek!:</strong> Due to human nature, it's difficult not to peek at the results early and draw conclusions or stop the experiment before the minimum sample size is reached. Resist the temptation. Sometimes the &quot;wrong&quot; model can get lucky for a while. You want to run a test long enough to be confident that the behavior you see is really representative and not just a weird fluke.</p>\n<p><strong>The more sensitive a test is, the longer it will take:</strong> The resolution of an A/B test (how small a delta effect size you can detect) increases as the square of the samples. In other words, if you want to halve the delta effect size you can detect, you have to <em>quadruple</em> your sample size.</p>\n<h3 id=\"extensions-to-a-b-testing\" tabindex=\"-1\"><strong>Extensions to A/B Testing</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p><strong>Bayesian A/B Tests</strong></p>\n<p>The classical (AKA frequentist) statistical approach to A/B testing that we described above can be a bit unintuitive for some people. In particular, note that the definitions of 𝞪 and 𝞫 posit that we run the A/B test over and over; in actuality, we generally run it only once (for a specific A and B). The Bayesian approach takes the data from a single run as a given, and asks, &quot;What OEC values are consistent with what I've observed?&quot;</p>\n<p>The general steps for a Bayesian analysis are roughly:</p>\n<ol>\n<li>\n<p>Specify prior beliefs about possible values of the OEC for the experiment groups. An example prior might be that conversion rates for both groups are different and both between 0 and 10%.</p>\n</li>\n<li>\n<p>Define a statistical model using a Bayesian analysis tool (ie. using distributional techniques) and flat, uninformative, or equal priors for each group.</p>\n</li>\n<li>\n<p>Collect data and update the beliefs on possible values for the OEC parameters as you go. The distributions of possible OEC parameters start out encompassing a wide range of possible values, and as the experiment continues the distributions tend to narrow and separate (if there is a difference).</p>\n</li>\n<li>\n<p>Continue the experiment as long as it seems valuable to refine the estimates of the OEC. From the posterior distributions of the effect sizes, it is possible to estimate the delta effect size.</p>\n</li>\n</ol>\n<img alt=\"Posterior distributions of a Bayesian treatment and control test.\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/Fig+2-IqZooIpGrI-400.png\" width=\"712\" height=\"505\" srcset=\"https://ninazumel.com/img/Fig+2-IqZooIpGrI-400.png 400w, https://ninazumel.com/img/Fig+2-IqZooIpGrI-712.png 712w\" sizes=\"100vw\">\n<p class=\"caption\">Posterior distributions of a Bayesian treatment/control test. Source: <a href=\"https://win-vector.com/2013/05/06/bayesian-and-frequentist-approaches-ask-the-right-question/\">Win-Vector Blog</a></p>\n<p>Note that a Bayesian approach to A/B testing does not necessarily make the test any shorter; it simply makes quantifying the uncertainties in the experiment more straightforward, and arguably more intuitive. For a worked example of frequentist and Bayesian approaches to treatment/control experiments (in the context of clinical trials), see this <a href=\"https://win-vector.com/2013/05/06/bayesian-and-frequentist-approaches-ask-the-right-question/\">blog post</a> from Win Vector LLC.</p>\n<h3 id=\"multi-armed-bandits\" tabindex=\"-1\"><strong>Multi-Armed Bandits</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p>If you want to minimize the waiting until the end of an experiment before taking action, consider <a href=\"https://cxl.com/blog/bandit-tests/\">Multi-Armed Bandit</a> approaches. Multi-armed bandits dynamically adjust the percentage of new requests that go to each option, based on that option's past performance. Essentially, the better performing a model is, the more traffic it gets—but some small amount of traffic still goes to poorly performing models, so the experiment can still collect information about them. This balances the trade-off between <em>exploitation</em> (extracting maximal value by using models that appear to be the best) and <em>exploration</em> (collecting information about other models, in case they turn out to be better than they currently appear). If a multi-armed bandit experiment is run long enough, it will eventually converge to the best model, if one exists.</p>\n<p>Multi-armed bandit tests can be useful if you can't run a test long enough to achieve statistical significance; ironically, this situation often occurs when the delta effect size is small, so even if you pick the wrong model, you don't lose much. In fact, the exploitation-exploration tradeoff means that you potentially gain more value during the experiment than you would have running a standard A/B test.</p>\n",
			"date_published": "2023-04-07T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2021-12-30-new-article-on-XI-coefficient/",
			"url": "https://ninazumel.com/blog/2021-12-30-new-article-on-XI-coefficient/",
			"title": "New Article on the XI coefficient",
			"content_html": "<p>I have a <a href=\"https://win-vector.com/2021/12/29/exploring-the-xi-correlation-coefficient/\">new article</a> up on the Win-Vector blog, about the ξ ('XI') correlation coeffient that was recently introduced by Professor Sourav Chatterjee in his paper, <a href=\"https://arxiv.org/abs/1909.10140\">“A New Coefficient of Correlation”</a>.</p>\n<img alt=\"XICOR coefficient\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/xicor-LotFIJdWtA-400.png\" width=\"672\" height=\"480\" srcset=\"https://ninazumel.com/img/xicor-LotFIJdWtA-400.png 400w, https://ninazumel.com/img/xicor-LotFIJdWtA-672.png 672w\" sizes=\"100vw\"> \n<p>Unlike traditional correlation coefficients, ξ does not assume that the relationship between <em>x</em> and <em>y</em> is linear; in principle, it can be any functional relationship. While this is potentially useful, ξ also has some disadvantages, too.</p>\n<p>In my <a href=\"https://win-vector.com/2021/12/29/exploring-the-xi-correlation-coefficient/\">Win-Vector post</a>, I run some informal experiments to try to get a sense of what different values of ξ might mean.</p>\n<p>Please check it out.</p>\n",
			"date_published": "2021-12-30T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2014-11-25-design-problem-solving-and-good-taste/",
			"url": "https://ninazumel.com/blog/2014-11-25-design-problem-solving-and-good-taste/",
			"title": "Design, Problem Solving, and Good Taste",
			"content_html": "<p>I ran across <a href=\"http://juretriglav.si/standards-for-graphic-presentation/\">this essay</a> recently on the role of design standards for scientific data visualization. The author, Jure Triglav, draws his inspiration from the creation and continued use of the NYCTA Graphics Standards, which were instituted in the late 1960s to unify the signage for the New York City subway system.</p>\n<img alt=\"New York City subway sign\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/subway-m1XI9ZOr89-400.png\" width=\"600\" height=\"378\" srcset=\"https://ninazumel.com/img/subway-m1XI9ZOr89-400.png 400w, https://ninazumel.com/img/subway-m1XI9ZOr89-600.png 600w\" sizes=\"60vw\">\n<p class=\"caption\">Image: <a href=\"http://juretriglav.si/standards-for-graphic-presentation/\">A Case for Spaceships</a> (Jure Triglav)</p>\n<p>As the author puts it, the <a href=\"http://thestandardsmanual.com\">Graphics Standards Manual</a> is \"a timeless example of great design elegantly solving a real problem.\" Thanks to the unified iconography, a traveler on the New York subway knows exactly what to look for to navigate the subway system, no matter which station they may be in. And the iconography is beautiful, too.</p>\n<img alt=\"Photo of Unimark Employees\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/unimark-REZnY1iaRR-400.png\" width=\"600\" height=\"337\" srcset=\"https://ninazumel.com/img/unimark-REZnY1iaRR-400.png 400w, https://ninazumel.com/img/unimark-REZnY1iaRR-600.png 600w\" sizes=\"60vw\">\n<p class=\"caption\">\nUnimark, the design company that designed the Graphics Standards.<br>Aren't they a hip, mod looking group? And I'm jealous of those lab coats.<br>Image: <a href=\"http://juretriglav.si/standards-for-graphic-presentation/\">A Case for Spaceships</a> (Jure Triglav)\n</p>\n<p>What works to clarify subway travel will work to clarify the morass of graphs and charts that pass for scientific visualization, Triglav argues. And we should start with the work of the Joint Committee on Standards for Graphical Presentation, a group of statisticians, engineers, scientists, and mathematicians who first adopted a set of standards in 1914, revised in 1936, 1938, and 1960. </p>\n<p>I agree with him -- mostly.</p>\n<p>The <a href=\"http://www.jstor.org/stable/2965153 .\">1914</a> and <a href=\"http://hdl.handle.net/2027/wu.89083916932\">1938</a> reports are online; if you have read William Cleveland's <em>The Elements of Graphing Data</em> or Darrell Huff's <em>How to Lie with Statistics</em>, you will have seen most of the guidelines before, although I thought the 1938 report in particular was especially clear and eloquent about its guiding principles. It should be noted that the 1938 document emphasizes that the guidelines are only that -- they are not intended as a set of rigid rules.</p>\n<blockquote><p>The committee believes that effective presentation calls for flexibility of treatment rather than for standardization, that each chart should be individually planned with due reference to the special characteristics of the data and the particular use to which the chart is to be put.</p></blockquote>\n<p>And in fact, while Cleveland and Huff definitely both echo the Joint Committee's recommendations, they do disagree in places, for example on whether or not a graph of quantities should always include zero. It depends on the use of the chart: exploration vs. presentation. The NYCMTA Graphics Standards address a specific situation; in this case, fixed, rigid standards are appropriate. When we are discussing all of scientific and engineering visualization, the best we can hope for are a set of guiding principles. What the Joint Committee -- and Cleveland, Huff, Tufte, and others -- were really trying to do is to set the standards for good taste.</p>\n<hr>\n<p>People think of taste as a subjective thing, and when it comes to food, fashion, film, art, or literature, that's true. One person's great read is another person's awful junk. I avoid accusing anyone of having \"bad taste\" when it comes to the subjects above. But in the problem solving disciplines - computer science (coding in particular), engineering, architecture, ergonomics, math, science, and so on - I think that bad taste is a real thing. A real harmful thing. We already use terms like \"elegant\" or \"ugly\" when we describe mathematical proofs, or code, or other solutions to various problems. Some \"solutions\" can be so ugly that they are in fact counterproductive. That's bad taste. </p>\n<p>Let's go back to our mass transit example with <a href=\"http://www.sarahdoody.com/everyday-ux-bart-ticket-machines-san-francisco/#.VHVcw76ppSU\">this critique</a> from user experience designer Sarah Doody on the badly designed ticket machines (that were in place at the time of her visit) for BART, San Francisco's subway/light-rail system. And in her criticism, she didn't even get to what I'd noticed was the biggest problem for new users: where the purchased ticket came out was <em>nowhere near</em> either the screen or the slot where you entered money; it came out well below eye level (in the red region of the left image, below). Compare that with the MTA's ticket machines, where the ticket dispensers are right next to the money insertion slot:</p>\n<img alt=\"Old BART ticket machine, compared to MTA ticket machine of the same era\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/tickets-001-je1lhQE0yA-400.png\" width=\"600\" height=\"265\" srcset=\"https://ninazumel.com/img/tickets-001-je1lhQE0yA-400.png 400w, https://ninazumel.com/img/tickets-001-je1lhQE0yA-600.png 600w\" sizes=\"60vw\">\n<p class=\"caption\">Left image: <a href=\"http://www.nileguide.com/destination/blog/san-francisco-bay-area/2010/08/19/getting-around-the-bay-on-public-transportation/\">Nile Guide</a>; Right image: <a href=\"https://www.flickr.com/photos/revstan/4375747918/\">Rev Stan, Flickr</a></p>\n<p>To my mind, the old BART ticket machine is the equivalent of spaghetti code: technically, it gets the job done, but it's ugly, incomprehensible, and as Ms. Doody points out, many of the choices that went into its creation are just plain wrong. Its design, such as it was, could be fairly called bad taste. Some people see it the other way:</p>\n<p>\n</p><blockquote><p>What we are trying to point out is: design is not always just a matter of taste. With enough design principles in mind (such as least astonishment, Liskov substitution, and a few others) you can actually say some design decisions are wrong (and maybe even some day some other design decisions are right). There are very few general principals of software system design, so you really don’t want to ignore the few you have.</p></blockquote>\n<div align=\"center\">-- John Mount, <a href=\"http://www.win-vector.com/blog/2014/09/factors-are-not-first-class-citizens-in-r/\">Factors are not First-class Citizens in R</a></div>\n<p></p>\n<p>I would argue that design <em>is</em> a matter of taste. It's just that, in the problem-solving disciplines, taste is not entirely subjective.</p>\n",
			"date_published": "2014-11-25T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2013-01-05-whats-wrong-with-a-lower-stress-job/",
			"url": "https://ninazumel.com/blog/2013-01-05-whats-wrong-with-a-lower-stress-job/",
			"title": "What&#39;s Wrong with a Low(er)-Stress Job?",
			"content_html": "<p>So there's this article that's been making the rounds called <a href=\"http://www.careercast.com/jobs-rated/10-least-stressful-jobs-2013\">\"The 10 Least Stressful Jobs of 2013\"</a>; perhaps you've read it. I don't normally bother with articles like that, but it came to my attention because some of my old graduate-school friends (who are professors) threw a mini-rant on social media over the fact that University Professor is the Number One least stressful job of the year, according to the article. And just now, I tripped over <a href=\"http://www.screwydecimal.com/2013/01/5-reasons-being-librarian-is-stressful.html\">a blog post where a librarian takes umbrage over the fact that they also on the list</a>.</p>\n<p>Curiosity led me to finally skim the article in question. I won't lie, I think some of their choices are odd, and the reasoning that led to those choices is rather simplistic. But I'm not going to quibble with the article itself; frankly, I don't really care (you notice I only said \"skim,\" not \"read\"). What I find interesting is that people are actually <em>offended</em> at being on that list.</p>\n<p>Think about some jobs that are truly high-stress. Firefighter. Police Officer. Emergency Medical Technician. A case worker for Child Protective Services (especially with budgets the way they are now). Pediatric Oncologist. Heck, what about being unemployed? Seems pretty darned stressful to me.</p>\n<p>A lot of high-stress occupations aren't well compensated, and many aren't particularly glamorous. I doubt that people in those professions thought to themselves, \"Let's see, what's the most stressful job I can think of? I'll go do that.\" I think they do those jobs <em>in spite</em> of the stress, because of innate vocation, or passion, or the desire to make the world a better place, or whatever. If you could magically make the stress of their jobs disappear, I don't think they'd complain.</p>\n<p>The problem is that \"high-stress job\" is often used as code for \"challenging job for hard-working, driven people\" -- which makes \"low-stress job\" code for \"easy job for lazy people.\" Really, they aren't the same thing. Hard work is a virtue; stress is a disease. A disease is something you should try to alleviate, not celebrate.</p>\n<p>Obviously, some jobs (like firefighter and police officer) are innately stressful, because they are dangerous, or because you always work in emergency conditions. And <a href=\"http://www.thedailybeast.com/newsweek/2009/02/13/who-says-stress-is-bad-for-you.html\">a little stress is good for you</a>, in the sense that stress is what pumps up your adrenaline to meet an immediate challenge, or that some level of difficulty in your job is what keeps it interesting, and what keeps you engaged. But if you aren't throwing yourself in the way of bullets or into towering infernos on a regular basis, perhaps you might think about how to separate the necessary hard work from the unnecessary demands on your energy.</p>\n<p>You know, like planning ahead and pacing yourself so you don't get caught unawares by deadlines. Saying \"no\" to more work when you are already overbooked. Trying not to get overbooked in the first place, to the extent you can avoid it. Figuring out how to sidestep tasks or situations or people that cause you stress or sap your energy. Or at least minimize the time you spend on such energy-drains.</p>\n<p>Those things aren't possible one hundred percent of the time, and they are more possible in some job situations than others. If you are in a job situation where it is possible, why be ashamed of that? Take advantage of it.</p>\n<p>Or to put it another way: <a href=\"http://www.stress-management-for-peak-performance.com/work-related-stress.html\">job-stress often comes from having no control over your situation</a>, or at least the perception of having no control.</p>\n<p>Is that really how you want your career to define you -- as someone controlled by the job, not vice-versa? Or would you rather be someone who works to meet all your goals and make your mark on the world on your own terms?</p>\n<p>I want to think of myself the second way. And if that means that people call my job \"low-stress\" -- even in a snarky way -- that's fine. Part of being in control is not caring about the opinions of people who are obviously wrong.</p>\n<p>Think about it.</p>\n",
			"date_published": "2013-01-05T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2012-12-18-on-balance/",
			"url": "https://ninazumel.com/blog/2012-12-18-on-balance/",
			"title": "On Balance",
			"content_html": "<p>One of my favorite cheesy movies is a gem from 1984 called <a href=\"http://en.wikipedia.org/wiki/The_Adventures_of_Buckaroo_Banzai_Across_the_8th_Dimension\"><em>The Adventures of Buckaroo Banzai Across the 8th Dimension</em></a>. For those who haven't seen it, Buckaroo Banzai is a brilliant young neurosurgeon and particle physicist who spends his days conducting cutting-edge research. At night, he and his research colleagues -- all engineers and scientists and doctors -- rock New Jersey as a band called the Hong Kong Cavaliers. In between the brilliant science and the rock-star night life, the Cavaliers find time to save the world from an alien invasion led by none other than John Lithgow.</p>\n<img alt=\"John Lithgow\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/Lithgow-iA5s1FULGt-400.png\" width=\"400\" height=\"230\">\n<p>It's very eighties: full of funky jackets with padded shoulders and some crazy hair. I can't recommend it enough.</p>\n<p align=\"center\">\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/AbBMzGUlIRw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n</p>\n<p>What happens if you want to be Buckaroo Banzai in real life? Here's what biologist Adam Ruben writes in his article <a href=\"http://sciencecareers.sciencemag.org/career_magazine/previous_issues/articles/2012_12_14/caredit.a1200137\">\"The Myth of the Well-Rounded Scientist:\"</a></p>\n<blockquote><p>Scientists with outside interests are often regarded with suspicion in the lab; we can be seen as undedicated, unfocused, easily distracted, and so divorced from the scientific frame of mind that we’ll probably end up working in—oh, the shame—industry.</p></blockquote>\n<p>Ruben started his \"Batman job,\" as he calls it -- stand-up comedy -- in grad school, and it was in grad school where he learned to hide his extracurricular activity.</p>\n<blockquote><p>One day, my adviser called me into his office. The campus newspaper had just published a little profile of the stand-up-comedy-performing grad student, and my adviser happened to read it. Over the next 10 minutes, I learned that my hobby was an embarrassment to the department, that there was no way I could properly focus on biology, and that every negative lab result I ever produced was a direct result of telling jokes at night.</p>\n<p>For a moment, I even believed it was true. …</p></blockquote>\n<p>It's not true, of course. Very few people truly want to spend every waking hour in the lab (or office) and, <a href=\"http://www.salon.com/2012/03/14/bring_back_the_40_hour_work_week/\">frankly, no one should</a>. And if you're not in the lab or the office, why shouldn't you be standing onstage somewhere, performing?</p>\n<p>It's a variation on <a href=\"http://www.theatlantic.com/magazine/archive/2012/07/why-women-still-cant-have-it-all/309020/\">the problem that professional women with children have faced for years:</a> the so-called \"work/life balance\" issue. I've always hated that phrase. It implies that if you have a \"life\" -- children, family, other creative interests, what have you -- then by definition, your work isn't part of your life. And so it follows that you aren't as \"dedicated\" or \"passionate\" about your work as you ought to be.</p>\n<p>And that's nonsense. I, too, have a \"Batman job\": I dance. I have rehearsal three to four times a week, and a performance at least once a month -- sometimes more. I love my Batman job. And I love my day job, too. Being a data scientist <em>is</em> a part of my life, just as much as being a dancer, a wife, a daughter, and a blogger are all parts of my life.</p>\n<p>It's not \"work/life balance\" -- it's \"life balance.\" For some people, that balance honestly means spending 99.5% of their waking hours eating, breathing, and dreaming about data science or biology or math or marketing strategy. For others, like me, balance means spending 50% of my time (or whatever 40 hours a week -- sometimes a little more, not much less -- comes to) thinking about data science, and 50% of my time thinking about other things.</p>\n<p>It also means that for that 50% of my time that I spend on data science, I concentrate on data science: my clients' projects, my data science writing, or my data science reading. Having other interests is an advantage here. I am forced to be efficient with the hours I spend on my day job, because no matter what (except for a dire emergency), at 7:30 pm I have to get up and go to rehearsal. I can't make up for lazy days with long nights in front of the computer.</p>\n<p>The break probably does my brain good, too. The mathematician Jacques Hadamard, in his book <em>The Psychology of Invention in the Mathematical Field</em>, wrote about what he and Henri Poincaré called \"incubation\": the process of letting go of conscious thought about a difficult problem and allowing your unconscious mind to work on it instead. Incubation leads to breakthrough. Here, Hadamard quotes Poincaré:</p>\n<blockquote><p>\"When, as must often happen, the thinker makes a false start, he slides insensibly into a groove and may not be able to escape at the moment. … Incubation would consist in getting rid of false leads and hampering assumptions so as to approach the problem with an 'open mind.'\" We can call this the <em>forgetting-hypothesis</em>.</p></blockquote>\n<p>In other words, when you are stuck on something, stop working and literally forget about it; think about something else. What better way to get your mind out of its rut than to go out and dance, or work on your stand-up comedy routine, or play with your kids? My husband, who is a dedicated computer scientist and mathematician, tells of similar experience. He recently started to teach himself to draw, and tries to spend a at least an hour a day working on sketching exercises. As with any exercise or drill, this can sometimes begin to feel tedious. The way my husband tells it, his brain is so desperate to break out of the tedium that it will of its own volition start chewing on whatever difficult problem has presented itself in his work life. By the time he is done with his exercises, he often has a new breakthrough, and can sit at the computer to attack his sticky problem with a fresh mental outlook.</p>\n<p>Being a 50% data scientist instead of a 99% data scientist doesn't mean I don't enjoy what I do for a living. It doesn't mean I'm not good at it. It doesn't mean that I take my responsibilities to clients and peers any less seriously than a 99 percenter. It does mean that I have chosen to give up certain achievements that likely come only with a eat-breathe-dream lifestyle. I will never win a Nobel or a Fulkerson Prize. I will never be a world-famous thought leader on data science (or anything else). I will never hold a Cabinet position. I will never run a multimillion-dollar corporation, or be a senior executive at such a corporation. I will never be as rich as Bill Gates or Sergey Brin. </p>\n<p>And that's okay. As long as I have a good professional reputation, as long as my peers and clients respect me and respect my work, I'm satisfied. Just don't mistake my lack of ambition for certain measures of success as a lack of dedication to my field -- or a lack of competence.</p>\n",
			"date_published": "2012-12-18T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2012-10-11-i-write-therefore-i-think/",
			"url": "https://ninazumel.com/blog/2012-10-11-i-write-therefore-i-think/",
			"title": "I Write, Therefore I Think",
			"content_html": "<p>I came across an interesting article in <em>The Atlantic</em> a little while back <a href=\"http://www.theatlantic.com/magazine/archive/2012/10/the-writing-revolution/309090/\">that discussed the connection between writing and thinking</a>. New Dorp, a Staten Island high school in a poor and working-class neighborhood, was able to improve student performance when they realized that their students couldn’t write. These underperforming students often could read and could do math. The majority of them were well-behaved, and seemed to want to learn. Yet they couldn't pass standard proficiency tests, and couldn't graduate. All because they couldn't form complex sentences.</p>\n<blockquote><p>The harder they looked, the teachers began to realize, the harder it was to determine whether the students were smart or not because the tools they had to express their thoughts were so limited that such a judgment was nearly impossible.</p></blockquote>\n<img alt=\"Fountain Pen. Photo by Nina Zumel\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/pen-o2B6gRdgLI-400.png\" width=\"450\" height=\"600\" srcset=\"https://ninazumel.com/img/pen-o2B6gRdgLI-400.png 400w, https://ninazumel.com/img/pen-o2B6gRdgLI-450.png 450w\" sizes=\"30vw\">\n<p class=\"caption\">Photo: Nina Zumel</p>\n<p>The solution the teachers devised was to teach analytical writing skills in almost every class. For example, in chemistry classes, students had to describe the properties of chemical substances in sentences that used specific subordinate clause forms, such as a sentence with <em>although</em>, or with <em>unless</em>. Students in literature classes had to hold oral discussions using structured sentence forms: \"I (dis)agree with your statement because...\", \"Can you explain your answer?\" They had to write expository essays in history class.</p>\n<p>The result? Graduation rates have risen from 63% to almost 80% since the beginning of the program. Pass rates on proficiency tests rose from 67% to 89% for the English exam, and 64% to to 75% for the History exam. There's still room for improvement, but the outlook at New Dorp is optimistic.</p>\n<p>Reading the <em>Atlantic</em> article, I got the suggestion that knowing how to form sentences and how to express themselves strengthened the students' ability not only to write and to pass tests, but also actually strengthened their ability to think. Once you know that there exist words and phrases like <em>because</em> or <em>for instance</em> that help expand your sentences, to elaborate on your basic premises, then you will want to start using them, right? It's like turning on a faucet.</p>\n<p>This apparently causal relationship between writing and thinking is no surprise for anyone who has to write as part of making a living. I find that I often don't truly understand a technical topic until I sit down to write about it. And some of my best non-technical writing happens when I have no fixed notion of what I'm going to say, just a vague idea that I must write about some topic, or that I must expand on some passing thought I had over a cup of coffee. The end result of the article or blog post surprises even me. Usually pleasantly, even.</p>\n<p>Here's Joan Didion, from her wonderful essay <a href=\"http://people.bridgewater.edu/~atrupe/ENG310/Didion.pdf\">\"Why I Write\"</a>:</p>\n<blockquote><p>Had I been blessed with even limited access to my own mind there would have been no reason to write. I write entirely to find out what I'm thinking, what I'm looking at, what I see and what it means. What I want and what I fear. ... <em>What is going on in these pictures in my mind?</em></p></blockquote>\n<p>And here's George Orwell, on why jargon is evil (from the essay <a href=\"http://iis.berkeley.edu/sites/default/files/Politics_%26_English_language.pdf\">\"Politics and the English Language\"</a>):</p>\n<blockquote><p>A man may take to drink because he feels himself to be a failure, and then fail all the more completely because he drinks. It is rather the same thing that is happening to the English language. It becomes ugly and inaccurate because our thoughts are foolish, but the slovenliness of our language makes it easier for us to have foolish thoughts. The point is that the process is reversible. Modern English, especially written English, is full of bad habits which spread by imitation and which can be avoided if one is willing to take the necessary trouble. If one gets rid of these habits one can think more clearly, and to think clearly is a necessary first step toward political regeneration: so that the fight against bad English is not frivolous and is not the exclusive concern of professional writers.</p></blockquote>\n<p>Orwell is talking about how words like \"freedom,\" \"terrorist,\" or \"socialist\" gradually lose their true meaning after years of overuse and mis-use, until they become content-free. Dialogue or debate that uses such words therefore also becomes content-free, and we all spend a lot of words saying nothing. When we say nothing, we think nothing: a vicious cycle. Places like New Dorp give us hope that words can feed a virtuous cycle, as well. Words have power.</p>\n<p>On the other hand, the New Dorp approach is rather formula-oriented, isn't it? It's old-fashioned, redolent of the old classic high school expository essay form. Remember that? State your thesis. Support it in the body of the essay; each body paragraph has a topic sentence and evidential support. Conclude by restating your thesis and re-examining it in the light of your evidence. The format is clear, and when done properly, it's an efficient way to get a point across. It's also usually quite dry.</p>\n<p>There are people who think old-fashioned is a good thing; back to the basics, and all that. There are people who don't. As some civil-rights activist supposedly once said (sorry, I don't remember who): \"I am suspicious of people who are nostalgic.\" With reason: the \"good old days\" were often not so good, for many different groups of people. In our discussion, that would be the disengaged student.</p>\n<p>So the modern teaching approach, apparently, encourages the student to develop self-expression, in the name of keeping them engaged, and fostering creativity. Sentence structure and the craft of organizing your thoughts don't seem to be primary lesson goals. So the <em>Atlantic</em> article claims; I'm not a teacher, and I don't have school-age children, so I don't really know. But if it's true, it's interesting, because some people would claim that the art of creative writing is the antithesis of thinking. Here's Robert Olen Butler, from his book <em>From Where You Dream: The Process of Writing Fiction</em>:</p>\n<blockquote><p>Please get out of the habit of saying that you've got an <em>idea</em> for a short story. Art does not come from ideas. Art does not come from the mind. Art comes from the place where you dream. Art comes from your unconscious; it comes from the white-hot center of you. ... If you want to think your way into your fiction, if you think you can analyze your way into a work of art, we're going to be totally at odds philosophically about what art is and where it comes from.</p></blockquote>\n<p>The truth, as always, is probably somewhere in between, but the point is that by Butler's argument, teaching creative writing is <em>not</em> teaching children how to think (it might even be teaching them not to think). And isn't the point of school to teach children how to think? That's what they keep telling us. It's interesting to contrast this with some current discussion about teaching math in schools, for example Andrew Hacker's now-infamous opinion piece from a few months ago, \"<a href=\"http://www.nytimes.com/2012/07/29/opinion/sunday/is-algebra-necessary.html?_r=1&amp;pagewanted=all&amp;\">Is Algebra Necessary?</a>\" According to Hacker, algebra is not a life skill; most people won't ever use it again. Putting aside whether that's true (it's not), a similar argument, it seems to me, could be made about creative writing. Why is algebra bad for being allegedly <em>impractical</em>, while analytical writing is bad for being <em>merely</em> practical?</p>\n<p>I wouldn't want the pinnacle of my literary achievement to be the high school expository essay, and I do wish I had taken more classes in creative writing during my formal education. The world would be a bland place if it were merely practical. But if writing well begets thinking well, then it transcends the practical: it's essential. And what else should we be teaching in schools, if not the essential?</p>\n",
			"date_published": "2012-10-11T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2012-09-19-on-being-a-data-scientist/",
			"url": "https://ninazumel.com/blog/2012-09-19-on-being-a-data-scientist/",
			"title": "On Being a Data Scientist",
			"content_html": "<p>When people ask me what it means to be a data scientist, I used to answer, \"it means you don't have to hold my hand.\" By which I meant that as a data scientist (a consulting data scientist), I can handle the data collection, the data cleaning and wrangling, the analysis, and the final presentation of results (both technical and for the business audience) with a minimal amount of assistance from my clients or their people. Not <em>no</em> assistance, of course, but little enough that I'm not interfering too much with their day-to-day job.</p>\n<p>This used to be a key selling point, because people with all the necessary skills used to be relatively rare. This is less true now; data science is a hot new career track. Training courses and academic tracks are popping up all over the place. So there is the question: what should such courses teach? Or more to the heart of the question -- what does a data scientist do, and what do they need to know?</p>\n<p>Hilary Mason and Chris Wiggins <a href=\"http://www.dataists.com/2010/09/a-taxonomy-of-data-science/\">took a crack at answering that a couple of years ago</a>. They break down data science, the process, into 5 steps: </p>\n<ul>\n<li><strong>Obtain</strong> the data: in their case from Web APIs. </li>\n<li><strong>Scrub</strong> the data: Look for missing data, bad data, outlier. Regularize text data (for instance locations: is \"CA\" California, or Canada? What about \"Cal.\", \"Ca\", \"California\", \"San Francisco\", etc..).\n    </li>\n<li><strong>Explore.</strong> And visualize. Here and during the scrub step is where I might start thinking about the best representations of the data, for modeling. Here is where I begin variable selection.</li>\n<li><strong>Model.</strong> And evaluate. This is where the statistics and machine learning knowledge comes in.</li>\n<li><strong>Interpret.</strong> And disseminate.</li>\n</ul>\n<p>That's basically the breakdown most of us would give. Their focus is on web analysis and on data collection over the web; generally my focus has been on clients who <em>have</em> the data (albeit in some completely cryptic form); it's our job to wring some insight from it -- somehow. So in addition to the emphasis that Mason and Wiggins place on scripting languages and unix tools, I would also add knowledge of SQL, and a tool like R that can access data directly from the database for analysis. My colleague John Mount would also add that <a href=\"http://www.win-vector.com/blog/2012/07/minimal-version-control-lesson-use-it/\">version-control is a must</a>. As with software engineering, data science is a process where \"that one last tweak\" to the model or to the data handling can turn out to be a tweak too many...</p>\n<p>Beyond the tools, and the technical details, though -- what would I add?</p>\n<p>I would add that the process is a loop; more than that, it's loops within loops. Obtain-Scrub-Explore is often one loop. Scrub (Represent)-Explore-Model can be another loop. It always depends.</p>\n<p>I would add that a healthy understanding of the business processes that generate the data is essential -- otherwise you are apt to \"discover\" things in the data that everyone (that is, your client) already knows, because they are known artifacts of the business process. The insights in data are like degrees of freedom. Don't eat up your degrees of freedom on known phenomena. If you don't have that domain knowledge yourself, make sure your client partners you with a contact who does.</p>\n<p>I would add that a solid understanding of statistics fundamentals is essential (and the whole <a href=\"http://www.win-vector.com/blog/\">Win-Vector blog </a>attests to how much time we spend thinking about fundamentals), but stat and machine learning are not the core of the job. The real science, in my opinion -- the part where you form hypotheses, test them, revise them -- comes less in the modeling and more in the scrub and explore steps. Why does this branch of the bank report recoveries where they never reported losses? What is that \"profit\" column reporting, really? Does gross national product really predict mortgage defaults, or is it just a proxy variable for time (and in the recent economy, time predicts mortgage default rate pretty well)?</p>\n<p>And there is more science after the modeling, during the evaluation phase. Or more prosaically: the debug phase. Why does the model report absolute nonsense on this one subset of the data? Is the error in the modeling? The data handling? The programming? The \"modeling\" step itself is actually a very small, and relatively straightforward, part of the overall process.</p>\n<p>No one ever wants to hear this. We all come into the job hoping to wield support vector machines or neural nets like Wonder Woman wields her magic lasso: we capture the data, and then wrest the truth out of it, willy-nilly. I wish. I'd love to wear those cool bullet-deflecting bracelets, too.</p>\n<img alt=\"Wonder Woman, by Alex Ross\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/newimage6-4T5gU9-Eur-300.png\" width=\"300\" height=\"379\">\n<p class=\"caption\">Art: Alex Ross</p>\n<p>My point here is that answering the original question is more a discussion of process than a checklist of skills to have and technologies to be familiar with.</p>\n<p>What would you add? What do you think a data scientist needs to know?</p>\n",
			"date_published": "2012-09-19T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2012-09-04-on-writing-technical-articles-for-the-nonspecialist/",
			"url": "https://ninazumel.com/blog/2012-09-04-on-writing-technical-articles-for-the-nonspecialist/",
			"title": "On Writing Technical Articles for the Nonspecialist",
			"content_html": "<p>I came across a post from Emily Willingham the other day: <a href=\"http://www.emilywillinghamphd.com/2012/08/is-phd-required-for-good-science-writing.html\">\"Is a PhD required for Good Science Writing?\"</a>. As a science writer with a science PhD, her answer is: is it not required, and it can often be an impediment. I saw a similar sentiment echoed once by Lee Gutkind, the founder and editor of the journal <em>Creative Nonfiction</em>. I don't remember exactly what he wrote, but it was something to the effect that scientists are exactly the wrong people to produce literary, accessible writing about matters scientific.</p>\n<img alt=\"A pocket watch. Photo by John Mount\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/watch-5zFYr8EKPV-382.png\" width=\"382\" height=\"600\">\n<p class=\"caption\">Photo: John Mount</p>\n<p>I don't agree with Gutkind's point, but I can see where it comes from. Academic writing has a reputation for being deliberately obscure and prolix, jargonistic. Very few people read journal papers for fun (well, except me, but I'm weird). On the other hand, a science writer with a PhD has been trained for critical thinking, and should have a nose for bullpucky, even outside their field of expertise. This can come in handy when writing about medical research or controversial new scientific findings. Any scientist -- any person -- is going to hype up their work. It's the writer's job to see through that hype.</p>\n<p>I'm not a science writer in the sense that Dr. Willingham is. I write statistics and data science articles (blog posts) for non-statisticians. Generally, the audience that I write for is professionally interested in the topic, but aren't necessarily experts at it. And as a writer, many of my concerns are the same as those of a popular science writer.</p>\n<p>I want to cut through the bullpucky. I want you, the reader, to come away understanding something you thought you didn't -- or even couldn't -- understand. I want you, the analyst or data science practitioner, to understand your tools well enough to innovate, not just use them blindly. And if I'm writing about one of my innovations, I want you to understand it well enough to possibly use it, not just be awed at my supposed brilliance.</p>\n<p>I don't do these things perfectly; but in the process of trying, and of reading other writers with similar objectives, I've figured out a few things.</p>\n<p><strong>It's not a research paper; don't write it like a research paper.</strong></p>\n<p>To the outsider (and sometimes, to the insider), academic writing is a giant exercise in <a href=\"http://en.wikipedia.org/wiki/Gamesmanship\">gamesmanship</a>. The goals are to demonstrate that you are smarter than your peers, and your research is innovative and novel. Those goals impede clarity; after all, if it's hard to read, it must be difficult material, and you must be one smart cookie.</p>\n<p>When you are writing for the public, or for the practitioner, you usually aren't writing about something you invented. This frees you from the pressure of appearing novel, and the topic doesn't have to seem profound. You don't have to try to look smart, either. By definition, you know something the reader doesn't -- and if you can explain it so that it seems obvious in hindsight, you actually look that much more clever.</p>\n<p><strong>Channel your inner undergrad.</strong></p>\n<p>This is related to the first point. Your readers are not your research peers, but they aren't stupid, either. They just have a different set of expertise. They won't know all the acronyms or the standard symbology, they won't know all the terminology or all the logic shortcuts (and occasional sloppy misuse of terminology) that people in the field are accustomed to. They are, however, motivated to learn the subject matter. It's your job to make it all make sense.</p>\n<p>This is where I have an advantage in writing about statistics: my PhD isn't in statistics. I learned it after I started working, because I had to. I remember a good deal of frustration with the general presentations of standard material given in textbooks. And I can remember even more frustrations with the \"insider\" style of writing in research papers -- often a lot of hard work for not a lot of reward. The <a href=\"http://www.win-vector.com/blog/category/statistics-to-english-translation/\"><em>Statistics to English</em></a> series of blog posts arose from that experience. It doesn't have to be that hard.</p>\n<p>Explain everything. If you are going to talk about p-values, for example, then define what they are; define significance, or at least point to a readable reference. Don't expect your readers to know that π means \"vector of probabilities\" and not \"the area of a unit radius circle.\" In any technical field, a clear explanation of definitions -- especially terms and symbols that are used differently in different fields, like \"entropy\" or \"likelihood\" -- is worth a lot. It may not seem like much, but believe me, your readers will thank you.</p>\n<p><strong>If an explanation helps make sense of a concept to <em>you</em>, it will probably make sense to someone else.</strong></p>\n<p>... and therefore, it will be helpful to someone, if not everyone. A related point to this is that parroting the textbook or research paper explanations is not always helpful, no matter how official or technical it sounds.</p>\n<p>An example: the definition of <em>likelihood</em> (or likelihood function) from <em>The Cambridge Dictionary of Statistics</em> is as follows:</p>\n<blockquote><p>The probability of a set of observations given the value of some parameter or set of parameters.</p></blockquote>\n<p>The dictionary goes on to give an example, the likelihood of a random sample of n observations, <em>x1,..x2,...xn</em> with probability distribution <em>f(x,θ)</em>:</p>\n<img alt=\"Formula for the likelihood of a random sample of n observations\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/newimage-wTCVlVURcn-236.png\" width=\"236\" height=\"100\">\n<p>This makes perfect sense, from a 50,000 foot point of view, especially if you are in the habit of thinking statistically. But what if you aren't? Or if you want to actually calculate a specific likelihood for a specific purpose? Like the person who asked a question about likelihood versus probability <a href=\"http://stats.stackexchange.com/questions/2641/what-is-the-difference-between-likelihood-and-probability\">here</a>. This person received several excellent answers, most of which were elaborations of the Cambridge definition, with variations on how the likelihood formula was written. This seems to have helped the original questioner; but I can tell you that back in the days when I was struggling to learn these concepts, it wouldn't have helped me. I learn by concrete examples. Like this (borrowed from one of the answers at the link):</p>\n<p>I have an unfair coin, and I think that the probability that it will land heads is <em>p</em>. I flip the coin n times, and I record whether it lands heads (x_i=1), or whether it lands tails (x_i=0). The likelihood of observing my series of coin flips, given that I have guessed probability <em>p</em> correctly is:</p>\n<img alt=\"likelihood of a series of coin flips\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/newimage5-5vZ-DOQPmQ-400.png\" width=\"429\" height=\"100\" srcset=\"https://ninazumel.com/img/newimage5-5vZ-DOQPmQ-400.png 400w, https://ninazumel.com/img/newimage5-5vZ-DOQPmQ-429.png 429w\" sizes=\"30vw\">\n<p>Here, I'm using the notation L(x|p) to emphasize that the likelihood of the set of observations X is dependent on my \"model\" -- the estimate for <em>p</em>. If the likelihood is high, I have guessed <em>p</em> correctly; if it is low, I need to re-estimate <em>p</em>.</p>\n<p>We can generalize this to any set of observations X that lead to a binary outcome, and any model for the probability, P(x).</p>\n<img alt=\"likelihood of a binary outcome\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/newimage3-xL4snWtU74-400.png\" width=\"600\" height=\"97\" srcset=\"https://ninazumel.com/img/newimage3-xL4snWtU74-400.png 400w, https://ninazumel.com/img/newimage3-xL4snWtU74-600.png 600w\" sizes=\"100vw\">\n<p>Again, if the likelihood isn't high, then we need to adjust our model P(x), probably by tweaking some parameter or parameters θ within the model. This leads us back to the original Cambridge definition.</p>\n<p>My formula is not as general as the Cambridge formula (or the formulas given by the people who answered the question in my link above), and it may still not be clear enough for everyone. Still, it helped me; this is the formula I use to <a href=\"http://www.win-vector.com/blog/2011/09/the-simpler-derivation-of-logistic-regression/\"> explain the use of likelihood in deriving logistic regression</a>. Judging by Win-Vector's blog stats, it helps other people out there, too.</p>\n<p><strong>Few things are \"obvious.\"</strong></p>\n<blockquote><p>But after all, the most successful device in mathmanship is to leave out one or two pages of calculations and for them substitute the word \"hence,\" followed by a colon. This is guaranteed to hold the reader for a couple of days figuring out how you got hither from hence. Even more effective is to use \"obviously\" instead of \"hence,\" since no reader is likely to show his ignorance by seeking help in elucidating anything that is obvious. This succeeds not only in frustrating him but also in bringing him down with an inferiority complex, one of the prime <em>desiderata</em> of the art.</p></blockquote>\n<div style=\"text-align:center;\">-- Nicolas Vanserg, \"Mathmanship\" (1958). Originally published in <em>American Scientist</em>, collected in <a href=\"http://www.amazon.com/Stress-Analysis-Strapless-Evening-Gown/dp/0138526087\"><em>A Stress Analysis of a Strapless Evening Gown: Essays for a Scientific Age.</em></a> Sorry, couldn't find the essay online.</div>\n<p>If it is \"obvious\" enough to be explained concisely, then explain it. If the calculation or derivation is short, then spell it out. Otherwise, use another phrase like \"it happens to be the case\", or \"it can be shown,\" with references -- or at least cop to the fact that it's a messy calculation. Some people will complain about how long your posts are; but there will also be an army of students and other novices who will be grateful to you, because they finally \"get it.\"</p>\n<p>And finally:</p>\n<p><strong>No matter how hard you try, someone will think you stink. Let it go.</strong></p>\n<p>Even if you don't write your article like a research paper, someone out there will read it (or criticize it) as if it were. If you try to define every concept and explain every chain of reasoning, you will get snarky \"TLDR\" (too long, didn't read) comments, or comments to the effect that it was a lot of reading for a point that was \"obvious.\" If you express an opinion, no matter how mildly or with any number of qualifications (for example, my colleague John Mount's article on <a href=\"http://www.win-vector.com/blog/2012/02/why-i-dont-like-dynamic-typing/\">why he dislikes dynamic typing</a>), you will get sarcastic comments from those who hold the opposite opinion, on why you are just wrong, or why the issues you point out are your fault, not (e.g.) dynamic typing's fault. You will get people hurling back at you points that you already addressed in the post.</p>\n<p>So fine, some people don't read (or are too impatient or closed-minded to read); they aren't your readers. Just let it go and move on.</p>\n<p>Being the concrete-minded person that I am, these points are addressed to my specific situation; but I hope that they are useful to other science writers and technical writers as well. I'm sure that I've violated many of these points in my own writing; hopefully the more I keep at it, the better my writing gets.</p>\n",
			"date_published": "2012-09-04T00:00:00Z"
		}
		
	]
}
