{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Nina B. Zumel",
	"language": "en",
	"home_page_url": "https://ninazumel.com/testblog",
	"feed_url": "https://ninazumel.com/feed.json",
	"description": "Data Scientist, San Francisco",
	"author": {
		"name": "Nina B. Zumel",
		"url": "https://ninazumel.com"
	},
	"items": [
		{
			"id": "https://ninazumel.com/blog/2024-01-29-fun-with-chatgpt/",
			"url": "https://ninazumel.com/blog/2024-01-29-fun-with-chatgpt/",
			"title": "Fun With Chat GPT",
			"content_html": "<p>So, my husband typed this into ChatGPT 3.5:</p>\n<blockquote>\n<p>What are some English words that are 4 letters long, start with f, and end with k?</p>\n</blockquote>\n<p>According to ChatGPT, there was only one word that fit that criterion: <em>fork</em>.  Upon prodding, it admitted that there were maybe a few more:</p>\n<img alt=\"Screenshot from ChatGPT 3.5\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-400.png\" width=\"3182\" height=\"2287\" srcset=\"https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-400.png 400w, https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-800.png 800w, https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-1200.png 1200w, https://ninazumel.com/img/chatgpt_fk-DwBxoayKTh-3182.png 3182w\" sizes=\"100vw\">\n<p>Typing a similar query into DuckDuckGo (<em>4 letter word starting with f ending with k</em>) produced a page full of links to various crossword puzzle and Scrabble dictionaries. The first link gave me seven words. A little further down, I found a link that gave me thirteen words: faik, fank, feck, filk, fink, firk, fisk, flak, folk, fork, funk, fusk, and of course, &quot;the F-word.&quot;</p>\n<p>I'm sure that ChatGPT has filters to eliminate profanity, and admittedly, not all the above words are &quot;common,&quot; but, come on -- <em>folk</em>? <em>funk</em>? <em>flak</em>??  I particularly like <em>feck</em>, though I never hear of anyone being &quot;full of feck,&quot; only &quot;feckless&quot; ...</p>\n<p>I'm sure GPT-4 does better, but I don't care to pay to find out.</p>\n",
			"date_published": "2024-01-29T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2023-08-21-the-sphering-transform/",
			"url": "https://ninazumel.com/blog/2023-08-21-the-sphering-transform/",
			"title": "The Sphering Transform for Detecting Distribution Drift",
			"content_html": "<p>I have a new blog post up on the Win Vector blog: <a href=\"https://win-vector.com/2023/08/20/detecting-data-differences-using-the-sphering-transform/\">Detecting Data Differences Using the Sphering Transform</a>.</p>\n<img alt=\"Distributions of sphered norms for two data sets with different distributions\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/new_raw_comp_xformed-s2pbz_kSJE-200.png\" width=\"609\" height=\"470\" srcset=\"https://ninazumel.com/img/new_raw_comp_xformed-s2pbz_kSJE-200.png 200w, https://ninazumel.com/img/new_raw_comp_xformed-s2pbz_kSJE-400.png 400w, https://ninazumel.com/img/new_raw_comp_xformed-s2pbz_kSJE-609.png 609w\" sizes=\"100vw\">\n<p>In this post, I discuss how to convert the problem of detecting changes in multivariate distributions to the simpler problem of detecting changes in univariate distributions. Please check it out.</p>\n",
			"date_published": "2023-08-21T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2023-04-10-pandas-polars-rosetta-stone/",
			"url": "https://ninazumel.com/blog/2023-04-10-pandas-polars-rosetta-stone/",
			"title": "Pandas-Polars Rosetta Stone",
			"content_html": "<p>Just created a <a href=\"https://github.com/WinVector/Examples/blob/main/pandas_polars_rosettastone/rosetta.ipynb\">handy little Rosetta stone</a> of common data operations using both the <code>pandas</code> and <code>polars</code> libraries. Maybe you'll find it useful, too.</p>\n",
			"date_published": "2023-04-10T00:00:00Z"
		}
		,
		{
			"id": "https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/",
			"url": "https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/",
			"title": "The What, Why, and How of AB Testing",
			"content_html": "<p><em>This article is a shortened version of a <a href=\"https://www.wallaroo.ai/blog/the-what-why-and-how-of-a/b-testing\">post from the Wallaroo Blog</a>, originally written by <a href=\"https://www.linkedin.com/in/juliobarros/\">Julio Barros</a> and me. I'm posting the non-Wallaroo section of that article here, with permission, because I think it's a useful reference for A/B testing---one that I refer to myself. Hopefully, others find it helpful as well.</em></p>\n<hr>\n<h2 id=\"how-to-a-b-test-machine-learning-models\" tabindex=\"-1\"><strong>How to A/B Test Machine Learning Models</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h2>\n<p><em>A/B tests are a key tool of business decision-making. In this article, we'll discuss the what and why of A/B testing, and how an A/B test is designed.</em></p>\n<h2 id=\"what-is-an-a-b-test\" tabindex=\"-1\">What is an A/B Test? <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h2>\n<p>An <a href=\"https://en.wikipedia.org/wiki/A/B_testing\">A/B test</a>, also called a controlled experiment or a randomized control trial, is a statistical method of determining which of a set of variants is the best. A/B tests allow organizations and policy-makers to make smarter, data-driven decisions that are less dependent on guesswork.</p>\n<p>In the simplest version of an A/B test, subjects are randomly assigned to either the control group (group A) or the treatment group (group B). Subjects in the treatment group receive the treatment (such as a new medicine, a special offer, or a new web page design) while the control group proceeds as normal without the treatment. Data is then collected on the outcomes and used to study the effects of the treatment.</p>\n<img alt=\"AB testing\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/AB-Testing-_poswn2rZ2-400.png\" width=\"900\" height=\"680\" srcset=\"https://ninazumel.com/img/AB-Testing-_poswn2rZ2-400.png 400w, https://ninazumel.com/img/AB-Testing-_poswn2rZ2-800.png 800w, https://ninazumel.com/img/AB-Testing-_poswn2rZ2-900.png 900w\" sizes=\"100vw\">\n<p class=\"caption\">Author: Seobility - License: <a href=\"https://www.seobility.net/en/wiki/Creative_Commons_License_BY-SA_4.0\">[CC BY-SA 4.0]</a>( \"Creative Commons License BY-SA 4.0\")</p>\n<h3 id=\"a-b-testing-in-history\" tabindex=\"-1\"><strong>A/B Testing in History</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p>This idea has been around for a long time. Historically, farmers have divided their fields into sections to test whether various treatments can improve their crop yield. Something like an A/B nutrition test even appears in the Old Testament!</p>\n<blockquote>\n<p>“Please test your servants for ten days. Let us be given vegetables to eat and water to drink. You can then compare our appearance with the appearance of the young men who eat the royal rations…&quot; (Daniel 1:12-13)</p>\n</blockquote>\n<p>In 1747, Dr. James Lind conducted one of the earliest clinical trials, testing the <a href=\"https://en.wikipedia.org/wiki/James_Lind#Prevention_and_cure_of_scurvy\">efficacy of citrus fruit for curing scurvy</a>.</p>\n<h3 id=\"a-b-testing-today\" tabindex=\"-1\"><strong>A/B Testing Today</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p>Today, A/B tests are an important business tool, used to make decisions in areas like product pricing, website design, marketing campaign design, and brand messaging. A/B testing lets organizations quickly experiment and iterate in order to continually improve their business.</p>\n<p><strong>In data science</strong>, A/B tests can also be used to choose between two models in production, by measuring which model performs better in the real world. In this formulation, the control is often an existing model that is currently in production, sometimes called the <strong><em>champion</em></strong>. The treatment is a new model being considered to replace the old one. This new model is sometimes called the <strong><em>challenger</em></strong>. In our discussion, we'll use the terms <em>champion</em> and <em>challenger</em>, rather than <em>control</em> and <em>treatment</em>.</p>\n<p>Keep in mind that in machine learning, the terms <em>experiments</em> and <em>trials</em> also often refer to the process of finding a training configuration that works best for the problem at hand (this is sometimes called hyperparameter optimization). In this article, we will use the term <em>experiment</em> to refer to the use of A/B tests to compare the performance of different models in production.</p>\n<h2 id=\"how-to-design-an-a-b-test\" tabindex=\"-1\"><strong>How to Design an A/B Test</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h2>\n<p>A/B tests are a useful way to rely less on opinions and intuition and to be more data-driven in decision making, but there are a few principles to keep in mind. The experimenter has to decide on a number of things.</p>\n<p><strong>First, decide what you are trying to measure.</strong> We'll call this the <em>Overall Evaluation Criterion</em> or <em>OEC</em>. This may be different and more business-focused than the loss function used while training the models, but it must be something you can measure. Common examples are revenue, click-thru rate, conversion rate, or process completion rate.</p>\n<p><strong>Second, decide how much better is &quot;better&quot;.</strong> You might want to just say &quot;Success is when the challenger is better than the champion,&quot; but that's actually not a testable question, at least not in the statistical sense. You have to decide <em>how much</em> better the challenger has to be. Let's define two quantities:</p>\n<ul>\n<li>\n<p><strong><em>y0</em></strong><em>:</em> The champion's assumed OEC. Since the champion has been running for a while, we should have a good idea of this value. For example, if we are measuring conversion rate, then we might already know that the champion typically achieves a conversion rate of <em>y0 =</em> 2%.</p>\n</li>\n<li>\n<p>𝞭: the <em>minimum delta effect size</em> we want to reliably detect. This is how much better the challenger needs to be for us to declare it &quot;the winner.&quot; For example, we may decide to switch to our challenger model if it improves the conversion rate by at least 1% – that is, we want the challenger to have a conversion rate of at least 0.02 * (1.01) = 0.0202. This means 𝞭 = 0.002.</p>\n</li>\n</ul>\n<p>Note that some sample size calculators (we'll get to that below) specify minimum effect size as a relative delta; in our example, the relative delta is 0.01 (1%), and the absolute delta is 0.002.</p>\n<p><strong>Third, decide how much error you want to tolerate</strong>. Again, you probably want to say &quot;none,&quot; but that isn't practical. The less error you can tolerate, the more data you need, and in an online setting, the longer you have to run the test. In the classical statistics formulation, an A/B test has the following parameters to describe the error:</p>\n<ul>\n<li>\n<p><strong>𝞪:</strong> the <em>significance</em>, or <em>false positive rate</em> that we are willing to tolerate. Ideally, we want 𝞪 as small as possible; in practice, 𝞪 is usually set to 0.05. You can think of this as meaning that if we run an A/B test over and over again, we will incorrectly pick an inferior challenger 5% of the time.</p>\n</li>\n<li>\n<p><strong>𝞫:</strong> the <em>power</em>, or <em>true positive rate</em> we want to achieve. Ideally, we would like 𝞫 near 1; in practice, 𝞫 is usually set to 0.8. You can think of this as meaning that if we run an A/B test over and over again we will correctly pick a superior challenger 80% of the time.</p>\n</li>\n</ul>\n<p>Note that 𝞪 and 𝞫 are talking about incompatible circumstances (that's why they don't add up to 1). The first case assumes the challenger is worse, the other case assumes it's better; finding out which situation we are in is the whole point of an A/B test.</p>\n<p>There's one last parameter in an A/B test:</p>\n<ul>\n<li><strong><em>n</em>:</strong> the minimum number of examples (per model) we have to examine to make sure our false positive rate 𝞪 and true positive rate 𝞫 thresholds are met. Or as it's commonly said: &quot;to make sure we achieve statistical significance.&quot;</li>\n</ul>\n<p>Note that n is per model: so if you are routing your customers between A and B with a 50-50 split, you need a total experiment size of 2<em>n customers. If you are routing 90% of your traffic to A and 10% to B, then B has to see at least n customers (and A will then see around 9</em>n). So a 50-50 split is the most efficient, although you may prefer an unbalanced split for other reasons, like safety or stability.</p>\n<p>To run an A/B test, the experimenter picks 𝞪, 𝞫, and the minimum effect size 𝞭, and then determines <em>n</em>. We won't go into the formula for calculating <em>n</em> here; so-called power calculators or sample-size calculators exist to do that for you. <a href=\"https://statsig.com/calculator\">Here's one for rates, from Statsig</a>; it defaults to 𝞪 = 0.05, 𝞫 = 0.8, and split ratio of 50-50. Feel free to play around to get a sense of how big sample sizes have to be in different situations.</p>\n<p>Once you've run the A/B test long enough to achieve the necessary <em>n</em>, measure the OEC for each model. If OECchallenger - OECchampion &gt; 𝞭, then the challenger wins! Otherwise, you may wish to stick with the champion model.</p>\n<h3 id=\"some-practical-considerations\" tabindex=\"-1\"><strong>Some Practical Considerations</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p><strong>Splitting your subjects:</strong> When splitting your subjects up randomly between models, make sure the process is truly random, and think through any interference between the two groups. Do they communicate or influence each other in some way? Does the randomization method cause an unintended bias? Any bias in group assignments can invalidate the results. Also, make sure the assignment is consistent so that each subject always gets the same treatment. For example, a specific customer should not get different prices every time they reload the pricing page.</p>\n<p><strong>A/A Tests:</strong> It can be a good idea to run an A/A test, where both groups are control or treatment groups. This can help surface unintentional biases or errors in the processing and can give a better feeling for how random variations can affect intermediate results.</p>\n<p><strong>Don't Peek!:</strong> Due to human nature, it's difficult not to peek at the results early and draw conclusions or stop the experiment before the minimum sample size is reached. Resist the temptation. Sometimes the &quot;wrong&quot; model can get lucky for a while. You want to run a test long enough to be confident that the behavior you see is really representative and not just a weird fluke.</p>\n<p><strong>The more sensitive a test is, the longer it will take:</strong> The resolution of an A/B test (how small a delta effect size you can detect) increases as the square of the samples. In other words, if you want to halve the delta effect size you can detect, you have to <em>quadruple</em> your sample size.</p>\n<h3 id=\"extensions-to-a-b-testing\" tabindex=\"-1\"><strong>Extensions to A/B Testing</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p><strong>Bayesian A/B Tests</strong></p>\n<p>The classical (AKA frequentist) statistical approach to A/B testing that we described above can be a bit unintuitive for some people. In particular, note that the definitions of 𝞪 and 𝞫 posit that we run the A/B test over and over; in actuality, we generally run it only once (for a specific A and B). The Bayesian approach takes the data from a single run as a given, and asks, &quot;What OEC values are consistent with what I've observed?&quot;</p>\n<p>The general steps for a Bayesian analysis are roughly:</p>\n<ol>\n<li>\n<p>Specify prior beliefs about possible values of the OEC for the experiment groups. An example prior might be that conversion rates for both groups are different and both between 0 and 10%.</p>\n</li>\n<li>\n<p>Define a statistical model using a Bayesian analysis tool (ie. using distributional techniques) and flat, uninformative, or equal priors for each group.</p>\n</li>\n<li>\n<p>Collect data and update the beliefs on possible values for the OEC parameters as you go. The distributions of possible OEC parameters start out encompassing a wide range of possible values, and as the experiment continues the distributions tend to narrow and separate (if there is a difference).</p>\n</li>\n<li>\n<p>Continue the experiment as long as it seems valuable to refine the estimates of the OEC. From the posterior distributions of the effect sizes, it is possible to estimate the delta effect size.</p>\n</li>\n</ol>\n<img alt=\"Posterior distributions of a Bayesian treatment and control test.\" loading=\"lazy\" decoding=\"async\" src=\"https://ninazumel.com/img/Fig+2-IqZooIpGrI-400.png\" width=\"712\" height=\"505\" srcset=\"https://ninazumel.com/img/Fig+2-IqZooIpGrI-400.png 400w, https://ninazumel.com/img/Fig+2-IqZooIpGrI-712.png 712w\" sizes=\"100vw\">\n<p class=\"caption\">Posterior distributions of a Bayesian treatment/control test. Source: <a href=\"https://win-vector.com/2013/05/06/bayesian-and-frequentist-approaches-ask-the-right-question/\">Win-Vector Blog</a></p>\n<p>Note that a Bayesian approach to A/B testing does not necessarily make the test any shorter; it simply makes quantifying the uncertainties in the experiment more straightforward, and arguably more intuitive. For a worked example of frequentist and Bayesian approaches to treatment/control experiments (in the context of clinical trials), see this <a href=\"https://win-vector.com/2013/05/06/bayesian-and-frequentist-approaches-ask-the-right-question/\">blog post</a> from Win Vector LLC.</p>\n<h3 id=\"multi-armed-bandits\" tabindex=\"-1\"><strong>Multi-Armed Bandits</strong> <a class=\"header-anchor\" href=\"https://ninazumel.com/blog/2023-04-06-what-why-how-abtesting/\">#</a></h3>\n<p>If you want to minimize the waiting until the end of an experiment before taking action, consider <a href=\"https://cxl.com/blog/bandit-tests/\">Multi-Armed Bandit</a> approaches. Multi-armed bandits dynamically adjust the percentage of new requests that go to each option, based on that option's past performance. Essentially, the better performing a model is, the more traffic it gets—but some small amount of traffic still goes to poorly performing models, so the experiment can still collect information about them. This balances the trade-off between <em>exploitation</em> (extracting maximal value by using models that appear to be the best) and <em>exploration</em> (collecting information about other models, in case they turn out to be better than they currently appear). If a multi-armed bandit experiment is run long enough, it will eventually converge to the best model, if one exists.</p>\n<p>Multi-armed bandit tests can be useful if you can't run a test long enough to achieve statistical significance; ironically, this situation often occurs when the delta effect size is small, so even if you pick the wrong model, you don't lose much. In fact, the exploitation-exploration tradeoff means that you potentially gain more value during the experiment than you would have running a standard A/B test.</p>\n",
			"date_published": "2023-04-07T00:00:00Z"
		}
		
	]
}
